Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 望着那个正一脸笑容的年轻魔法师，老梅林心中忽然充满了懊悔。
en_us: Looking at the young mage who was all smiles, Old Merlin was filled with regret.

source: 望着那翩然离去的背影，林不由得呆住了，在街上站了很久，才想起看看手上的东西。
en_us: Lin Li was stunned as he stared at the figure that had just left. He stood at the street for a long time until he finally remembered the item in his hands.

source: 本来这告示一出来，绝对会有很多人找江逸对练的，但江逸既然开口了，杨管事还指望他赚钱，也不好拂他的面子，从怀中取出一块令牌递给江逸道：“在武殿内学习武技本是要紫金的，不过你现在是紫金陪练，我可以给你个特权，你去藏书阁找白管事，任意学习三种人阶武技，这是我的令牌。给你五天假期，五天之后你必须上场陪练。”
en_us: Originally, with the release of this announcement, there would definitely be a lot of people who would seek Jiang Yi for sparring practice. However, since Jiang Yi had opened his mouth, while Manager Yang still counted on him to make money and knew that it was not good to brush him aside or make him lose face, Manager Yangdecided to retrieve a token from his breast-pocket and passed it to Jiang Yi. Manager Yang said, "To train one's martial arts techniques in the Martial Arts Hall, one should start off with paying purple gold. However, since you're a purple gold token-grade sparring partner now, I can grant you a certain special privilege. You can go to the Book Storage Pavilion and search for Manager Bai, and learn any three human-grade martial arts techniques, chosen at your own will. This is my command token. I'll let you take five days of leave, but after five days, you must go into the combat training field and conduct sparring practice."

source: 杀死双足飞龙只不过是运气，那一支冰锥恰好扎进了双足飞龙的伤口，若不是因为这样，他早就被双足飞龙撕成碎片了。
en_us: It was only luck that he managed to kill the Wyvern with that shot of icicle piercing right into the Wyvern’s wound. If not for that, he'd long be torn to pieces by the Wyvern.

source: 来之前就想好了说辞，却生生在肚子里憋了一个上午，克伦威尔就差没被憋出内伤来了，现在好不容易把凯文给逮住了，又哪还肯给他反抗的机会，自从双手抓住凯文之后，这家伙就再没松过手，从两人小时候的交情谈起，一直谈到梅林家与魔法公会悠久而深厚的友谊。
en_us: Cromwell had thought of his plea before he came, but because he had to hold it back for the whole morning, he had almost gotten sick from keeping it in for too long. Now that he finally caught up with Kevin, he'd never give him a chance to resist. He had not let up ever since he had a grab of Kevin's hands. He began with the friendship they had shared since childhood, and then went on to talk about the deep and long-standing friendship between the Merlin Family and the Guild of Magic.

source: 来人是一个穿着火红色武士袍的少女，一脸扯高气昂，姿色算是中等，比起姬听雨还差一个档次，不过因为穿着紧身武士袍，将凹凸有致的身材完全显露出来，很是惹火。
en_us: Just as he thought of posing a few queries regarding the rules, the sound of footsteps rang from the corridor behind him. The manager immediately cast him away and sent him off with a smile. The person who arrived was a teenage girl dressed in fiery-red martial artist robes. With an arrogant look on her face and moderately good looks, she was a level lower compared to Ji Tingyu. However, as she wearing body-hugging martial artist robes that made the shapely contours of her figure visible, she was attractive.

source: 来到武殿已经整整一个月了，江逸除了修炼外都是破解封印符文。封印符文破解的速度很快，修炼的进展也很快，按他估计差不多还要一个半月，他就能达到铸鼎境四重了。
en_us: It had been a month since Jiang Yi came to the Martial Arts Hall. Besides cultivating, he spent all his energy on breaking the runic patterns on the seal. The progress for both was fast. By his estimation, it would only take approximately another month and half for him to reach the fourth stage of the Cast Tripod Realm.

source: 来到这个陌生的世界一个多月，林立心里第一次有了温暖的感觉，他恭恭敬敬的对安度因鞠了个躬：“谢谢。”
en_us: After more than a month in this unfamiliar world, Lin Li felt warmth for the first time. He bowed to Andoine respectfully and said, "Thank you."

source: 杨管事一张老脸上都是不解和困惑，他看了画面很久还是惊疑不定，最终朝白发老者拱手道：“费老，您怎么看？”
en_us: Manager Yang's elderly face revealed a look of non-comprehension and confusion. He stared at the images for a very long time, but remained completely bewildered. Finally, he raised his hands in surrender towards the elderly man with white hair and said, "Elder Fei, what do you make of this?"

source: 杨管事一挥手让护卫下去，这才笑容可掬的和江逸说道：“苍狼，我也不瞒你，开门见山的说了，我代表武殿想和你做一笔交易。”
en_us: Manager Yang waved his hands to send away the guard. It was only then that, beaming from ear to ear, he addressed Jiang Yi by saying, "Lone Wolf, I don't want to beat around the bush, so I will say this to you directly that, on behalf of the Martial Arts Hall, I would like to make a deal with you."

source: 杨管事也是一愣，三位公子看到江逸带着铜牌面具更是满眸错愕，姬小姐铸鼎境八重和一个小小的铜牌陪练对战什么？一根手指头怕是就能戳死江逸吧？
en_us: Manager Yang similarly stared at her blankly, while the three gentlemen stared at Jiang Yi, who was wearing a bronze mask, with much astonishment in their eyes. How could Young Mistress Ji, with a power level at the eighth stage of the Cast Tripod Realm, possibly choose to fight with a little bronze token-grade sparring partner? Would her finger alone not be able to stab Jiang Yi to death?

source: 杨管事傻眼了，看着江逸也一副见鬼了的表情。这铸鼎境一重武者怎么可能是金牌陪练？要是人人都是金牌陪练，武殿也不用如此急迫的招人了……
en_us: Manager Yang was flabbergasted. He looked at Jiang Yi as though he had seen a ghost. How could this martial artist at the first stage of the Cast Tripod Realm be a gold-token-grade sparring partner? If everyone was a gold-token-grade sparring partner, then the Martial Arts Hall would not be so desperately hiring new staff...

source: 杨管事哑然失笑，解释道：“苍狼，你只是受聘于武殿，你并不是武殿的人，换句话说你是在做工，我们付工钱。武殿内其余的几名金牌陪练也和我们有交易的，苍狼啊……你别把事情想得那么复杂，实话和你说吧，我就看重你变态的战斗本能，反应速度，准备培养你一番，让你成为顶级的金牌陪练，这样你能替武殿赚钱，就这么简单！”
en_us: Manager Yang laughed involuntarily and explained, "Lone Wolf, you're only being hired by the Martial Arts Hall. You're not one of the men of the Martial Arts Hall. In other words, you have a paid job, and we provide you the salary. The few other gold token-grade sparring partners in the Martial Arts Hall have also signed contractual deals with us. Lone Wolf... don't think about things in such a complicated manner. To tell you the truth, I take great interest and importance in your obscenely powerful natural ability in combat and reaction speed, and am ready to invest resources and nurture your skills, so that you can become a top-quality golden token-grade sparring partner. In this way, you can help the Martial Arts Hall make money. It's just that simple a situation!"

source: 杨管事在听说江逸准备在武殿内闭关三月哪也不去，不仅没有半点不满，反而大方的免了江逸的食宿费。江逸能在这全力修炼，尽早提升到铸鼎境四重，武殿内就能快速增加一位金牌陪练，也能为他们赚取更多的银钱。要知道在这武殿内和陪练对战，金牌陪练那可是按每场收费的……
en_us: Manager Yang was not displeased at Jiang Yi's intention to go into seclusion at the Martial Arts Hall for three months. Rather, he generously waived Jiang Yi's boarding expenses. Jiang Yi was able to concentrate all his energy into cultivation to elevate his powers to the fourth stage of the Cast Tripod Realm. In doing so, the Martial Arts Hall would then acquire a gold token-grade sparring partner, who charged by each match...

source: 杨管事坐了一小会，和门口的一名护卫吩咐道。护卫匆忙朝练功房方向走去，很快就把满眸疑惑的江逸带了进来。
en_us: Chief Yang sat down for a short while as he instructed a guard standing at the door. That guard hastily walked in the direction of the Technique Practising Room and very quickly brought Jiang Yi, with his eyes revealing emotions of confusion and doubt, into the room.

source: 杨管事大笑，傲然说道：“不需要那东西，武殿不会违约，也从不怕……别人违约！行了，这瓶丹药你先拿着，你去大殿内修炼吧。这几天不到万不得已的情况，我不会让你上场的，你现在主要的任务就是修炼，尽快提升到铸鼎境四重。”
en_us: Manager Yang laughed loudly and proudly replied, "There's no need for that kind of thing. The Martial Arts Hall will never breach a contract, and has never been afraid... that someone else would breach a contract either! That's settled then. You hold on to this elixir bottle first. Head over to the interior of the Great Hall and cultivate your power. For these next few days, unless as an absolute last resort, I will not send you out for a sparring match. Your main task right now would be to cultivate your power and increase its level to the fourth stage of the Cast Tripod Realm as soon as possible."

source: 杨管事头疼的望着一群全部伤痕累累的陪练，又四处一扫其余练功房，看到没有一名白银陪练走出，只能无奈指着江逸道：“苍狼，出战。”
en_us: Nursing a headache, Manager Yang looked at the group of sparring partners, all of them riddled with injuries, before giving the rest of the technique-practicing rooms a sweeping glance. Seeing as none of the silver-token-grade sparring partners had left their rooms, he could only helplessly point at Jiang Yi and order, "Lone Wolf, you're up for combat."

source: 杨管事急了，这好不容易招到一个好陪练，他怎么能眼睁睁看着江逸走？这几日他可是被这群公子小姐催得头顶冒烟了。连忙凑过来和江逸笑眯眯的说道：“苍狼，你是不是嫌弃钱少了？这样……你继续在这呆着，我给你按银牌陪练的钱算？十两银子一天，如何？”
en_us: Manager Yang was flustered. He had finally managed to hire a good sparring partner after so much difficulty. How could he allow himself to look on helplessly and allow Jiang Yi to leave willy-nilly? After all, he had been so hard-pressed by the demands of that group of young masters and young mistresses over the past few days that he was frustrated and fuming with rage. Hurriedly moving closer to Jiang Yi and beaming at him, Manager Yang said, "Lone Wolf, is it just that you simply dislike how low the pay is? In that case... you continue staying here, and I'll pay you the rate for a silver token-grade sparring partner? Ten taels of silver a day, how about that?

source: 杨管事想不通，不过他知道如果下次江逸还来陪练，一定得想方设法留住他。如果他的确能帮助武殿内的公子小姐们武技快速大成，那么他的价值就不可估量了……
en_us: Manager Yang could not understand any of it. However, he knew that the next time Jiang Yi should ever return as a sparring partner, he had to find some way to make him stay. If he could indeed help the young masters and young mistresses in the Martial Arts Hall achieving phenomenal success in speeding up the improvements of their martial arts skills proficiency, then his value would be virtuely incalculable...

source: 杨管事敞开来说了，江逸反而内心安定，他沉思了一会，最终眼中露出一丝狠色，咬牙道：“在这干五年可以，不过我有两个要求。”
en_us: With Manager Yang's full disclosure of his intentions, Jiang Yi on the other hand became more calm in his heart. He thought deeply for a while, before finally revealing a look of ruthlessness in his eyes. He gritted his teeth and responded, "I don't have a problem with working here for five years, but I have two requests."

source: 杨管事淡淡一笑道：“很简单，你这算违约，按规矩要赔付百倍财物，我算了下差不多你要赔偿武殿一万两紫金，当然……如果你死了，这合约就自动解除。”
en_us: With faint smile, Manager Yang replied, "Very simple - this is considered a breach of contract. According to the rules stipulated, you would have to repay a hundred times worth in valuables. According to my calculation, you would owe the Martial Arts Hall almost ten thousand taels of purple gold. Of course... if you die, this contract will automatically be cancelled."

source: 杨管事疑惑地眨了眨眼睛，询问道：“怎么了？翊小姐，那个陪练有问题？”
en_us: Puzzled, Manager Yang blinked his eyes and inquired, "What's the matter? Young Mistress Yi, was there a problem with that sparring partner?"

source: 杨管事的确不在练功房，而是在附近的一个小房间内，他不是一个人，小房间内还有一个衣袍华贵的白发老者，两人正聚精会神的观看着墙壁上的一幅画面。
en_us: Manager Yang was indeed not in the Technique Practising Room, but rather in a small room nearby. He was not alone - there was an elderly man with white hair and elegant robes in the small room as well. The two men were attentively observing a painting on the wall.

source: 杨管事笑着起身，点头道：“没问题，不过你必须在这干满十天之后，我才能给你预支，另外还有问题吗？没有的话，祝我们合作愉快！”
en_us: Manager Yang smiled as he stood up, before nodding and responding, "No problem, but you must work for ten full days here. Only then will I give you an advance on your pay. Are there any other questions? If not, I hope we have a good working partnership and business collaboration!"

source: 杨管事脸色顿时变了，满眸都是悔意。这练功房对练，主要目的就是训练反应速度，战斗本能，还有磨砺武技。这三项都很难提升，需要长时间的对战和磨练，这也是练功房内封印元力的原因。
en_us: Manager Yang's facial expression suddenly changed, as his pupils became filled with remorse. The main purpose of conducting sparring practice at this Technique Practising Room was to facilitate the training of a person's reaction speed and combat instincts as well as improve a person's martial arts skills. It was very difficult to improve these three aspects, requiring a long time of combat practice and honing of skills. This was also the reason why the Technique Practising Room sealed off the use of essence force.

source: 杨管事连忙把江逸原先戴的苍狼面具给江逸，朝旁边的一个下人打了个眼色，那人立即匆匆离去。
en_us: Manager Yang hurriedly passed to Jiang Yi the wolf mask he was originally wearing, before giving a visual signal to a servant standing next to him. That servant immediately left in a hurry.

source: 杨管事连忙拱手俯身，等费老离去后，他才快步走到墙壁边上，一只手元力环绕按在一块石砖上，那墙壁上的画面神奇的消失了，又变成一面雪白的石墙。
en_us: Manager Yang promptly cupped his hands in greeting and bowed in sending Elder Fei off. It was only once Elder Fei had left that he walked with a quick pace to one of the walls. Using one of his hands, which had essence force revolving around it, to press on a stone brick, the image being broadcast on the wall magically vanished, becoming a snow-white stone wall face once again.

source: 杨管事随意一摆手道：“你说吧，只要不过分都好说。”
en_us: Manager Yang nonchalantly waved his hands and replied, "Say it, it's all negotiable so long as it isn't too excessive or demanding."

source: 杨管事颔首道：“没错，武殿会在两个月内全力培养你达到铸鼎境四重，你则必须在这当陪练五年，当然……武殿会根据你的实力，给予相对应的薪水，比如你实力是银牌陪练时，一天十两银子，实力达到金牌陪练时，一天一两紫金。”
en_us: Manager Yang nodded his head and replied, "That's right. The Martial Arts Hall will spare no expense in nurturing you over the next two months such that your power level reaches the fourth stage of the Cast Tripod Realm. In exchange, you must be a sparring partner here for five years. Of course... The Martial Arts Hall will, based on your power, give you the corresponding salary. For instance, when your power is on par with that of a silver token-grade sparring partner, the rate is ten taels of silver per day; when your power is on par with that of a gold token-grade sparring partner, the rate will be a tael of purple gold per day."

source: 林立一句话出口，宾客众当场晕了三四个。
en_us: As soon as Lin Li uttered the words, a few guests had fainted right on the spot.

source: 林立一只手捏着袋口，很小心很小心的抖了一抖，让少许星辰沙流入烧杯。
en_us: With one hand grasping the opening of the pouch, Lin Li shook it carefully, letting a little star sand into the beaker.

source: 林立一手握紧点金棒，精确操纵着先前融入的那一丝精神力，在这一丝精神力的催动之下，尾端的魔力源泉开始运转，一股魔力从魔晶中缓缓放出，顺着那复杂的魔力回路流转，最后一一激活十三个魔力节点。
en_us: Lin Li tightened his grip on the gold rod with one hand and controlled with precision the mental strength he had previously imbibed. With the stimulation of the mental strength, the source of mana at the end of the gold rod began to run. A wave of mana was slowly released from the magical crystal and flowed through the complex magic circuit, at last activating the 13 magic nodes.

source: 林立一直在想，这么炸来炸去，这倔老头会不会真有一天被炸出个好歹来……
en_us: Lin Li had been wondering whether the stubborn old man would be blown up one day.

source: 林立一看葛瑞安如此郑重，也知道肯定不是小事，拉了张椅子过来坐下，静静等他开口。
en_us: Lin Li knew it wasn't a trivial matter seeing how serious Gerian was. He pulled a chair and took a seat, quietly waiting for Gerian to start.

source: 林立一看葛瑞安那表情，就知道这老家伙肯定又弄了什么好处：“什么生意？说来听听……”
en_us: Lin Li knew the old fellow had to have gotten something good judging by the look on his face. "What business deal? Tell me..."

source: 林立一看这丝黑线，心头就有了不祥的预感。
en_us: Lin Li had a foreboding feeling in his heart as soon as he saw the black line.

source: 林立一记怒焰风暴出手，就感觉出了其中的异样，那剧烈而又沉闷的爆炸声，完全是两股魔法元素对冲造成的，若是直接击中巴瑟罗尔，根本就不会制造出如此浩大的声势，只需要一股烈焰就能将他瞬间吞没。
en_us: At the moment Lin Li unleashed the Flaming Storm, he sensed there was something different. The violent and muffled explosion was caused by the collision of two magical elements. If it had hit Bathrilor directly, it wouldn't have made such a great noise. It would only take a flame to engulf him in an instant.

source: 林立一边往烧杯中添加宁神花汁液，一边细心计算着三种药水的比重，这中间他只是偶尔抬手擦去额头上的汗水，很快又埋下头去继续忙碌。
en_us: Lin Li added nectar from the peacebloom into the beaker as he meticulously calculated the ratio of the three potions. He had only raised his hand to wipe the sweat off his forehead occasionally, and then quickly buried his head back to work.

source: 林立不是不知感恩的人，魔法公会上上下下对他怎么样，他心里比谁都清楚，特别是葛瑞安，更是几乎将公会未来都赌到了他身上，在这个时候，林立觉得自己有义务为公会出一份力。
en_us: Lin Li was not an ungrateful man. He knew most clearly how everyone in the Guild of Magic had treated him. Gerian, in particular, had even bet the guild's future on him. At that point, Lin Li felt obligated to contribute to the guild.

source: 林立与凯文下了马车，很快就有仆人上前迎接，神色恭敬的从两人手中接过请柬，又殷勤的将两人迎进府内。
en_us: Lin Li and Kevin got out of the carriage, and soon a servant came up to meet them. He took the invitation card from them with great respect and politely escorted them into the mansion.

source: 林立与葛瑞安面面相觑，这场拍卖已经远远超出了两人的估计，数十万金币，外加一百套精良的魔法装备，如果这最后十瓶再拍出天价的话，两人怕是真要沦落到用钱砸人玩的地步了……
en_us: Lin Li and Gerian looked at each other. The auction had far exceeded their estimates—hundreds of thousands of gold coins, and 100 sets of excellent magic equipment; if the last ten bottles were sold for a sky-high price, the two men would probably be reduced to the point of smashing people with money.

source: 林立之所以会记得这个诅咒的名字，还是因为一种叫做死亡之心的草药。
en_us: The reason why Lin Li remembered the name of this curse was because of a herb called Heart of Death.

source: 林立也是不敢怠慢，赶紧为自己施加了一个迅捷术，紧随中年冒险者身后跑了出去。
en_us: Lin Li did not tarry, either. He cast the Hastening Spell and followed after the middle-aged adventurer.

source: 林立什么也没说，只是笑咪咪的望着葛瑞安。
en_us: Lin Li did not say anything. He watched Gerian with a grin on his face.

source: 林立什么眼色，克伦威尔那表情落入眼里，又哪会不知道他在想些什么……
en_us: Lin Li was good at taking hints. As Cromwell's expressions fell into his eyes, he knew exactly what was going on in his mind...

source: 林立从无尽风暴之戒中，又摸出了那把银质小刀，轻轻割开恶魔之泪的表皮，看到一滴汁液将要溢出之时，迅速将它丢进烧杯当中。
en_us: Lin Li pulled out the silver knife from the Ring of Endless Storm and gently cut off the skin of the devil's tears. When he saw a drop of succus about to spill, he quickly dropped it into the beaker.

source: 林立从来就不是一个能闲住的人，手上掌握着这么个大杀器，又哪有不拿出来用用的道理？
en_us: Lin Li was not someone who could keep still. With such a deadly weapon in his hands, was there any reason not to use it?

source: 林立仔细想了想，发现自己还真没什么事情可做，图书馆的咒语已经抄得差不多了，加入魔法公会的手续也已经办完，再加上凯文这几天跑上跑下，确实帮了自己不少的忙，要是连这点要求都拒绝，好象真不怎么厚道。
en_us: Lin Li thought over it carefully and realized he had nothing to do indeed. He had taken down the spells from the library, and the procedures for joining the Guild of Magic had been completed. Moreover, Kevin had been running around these days and had given him much help. It didn't seem kind of him to reject such a small request.

source: 林立伸了个长长的懒腰，将桌上的书本一一放回原位，正打算离开图书馆的时候，却看见凯文走了进来。
en_us: Lin Li did a long stretch and returned the books to their original position. He was about to leave the library when he saw Kevin walking in.

source: 林立俯身望着克伦威尔，脸上仍然带着笑容，只是眼中透出的凶光，却让克伦威尔毫不怀疑，他会在一抬手间杀死自己。
en_us: Lin Li bent over Cromwell, the smile never leaving his face. Only his eyes revealed a menacing light, such that Cromwell never doubted he'd kill him with a lift of his hand.

source: 林立倒是老实，很干脆的就认了下来。
en_us: Lin Li remained honest and admitted frankly.

source: 林立做梦也没有想到，在一堆宁神花药渣中，竟然能发现几片黑莲花的花瓣。
en_us: Lin Li could never dream that he'd discover the petals of a black lotus among the peacebloom dregs.

source: 林立停下了魔力输出，将配好的龙血墨水放到一旁。
en_us: Lin Li stopped the output of his mana and placed the completed Dragon's Blood Ink at a side.

source: 林立出了图书馆之后，很快就在一楼大厅找到了葛瑞安。
en_us: Lin Li left the library and very soon found Gerian in the hall on the ground floor.

source: 林立刚一抬头，就看见一脸焦急的凯文往这边走来，也不知道是遇上什么事了，此时的凯文看上去神色焦急脚步匆忙，一张白皙的脸上，更是堆满了焦虑的表情。
en_us: Lin Li lifted his head and saw Kevin walking towards them with an anxious expression on his face. Something must have happened—Kevin looked tense and his footsteps were hurried; worry was written all over his fair face.

source: 林立刚往前走出六七步远，就忽然察觉到四周魔法元素剧烈扭曲，他几乎是下意识的感觉不对，想要反应却已是有些来不及了，只好勉强撑起一面元素护盾。
en_us: Lin Li had just taken six or seven steps when he suddenly felt a violent distortion of the magical elements around him. Almost subconsciously, he felt something was wrong. But it was too late to react so he had barely managed to put up an elemental shield.

source: 林立刚看见那一头如火的长发，两只眼睛就顿时睁圆了，他怎么也没有想到，居然会在城主府宴会上看见这个女人。
en_us: Lin Li's eyes widened as soon as he saw the fiery-red long hair. He never thought that he would see this woman at the banquet in the Castellan Mansion.

source: 林立又将椅子挪了挪，给罗琳腾出位置，三人围着桌子重新坐下，老格林这才冲林立点了点头，示意他可以提出疑问了。
en_us: Lin Li shifted his chair to make room for Rowling. The three of them sat down again around the table. Old Grimm then nodded at Lin Li and signalled that he could ask his questions.

source: 林立反应也是极快，人在空中飞速上升，心头却是异常冷静，也不见他如何吟唱咒语，只是一个奇异的手势，一发风刃已经发出了尖锐的破空之声。
en_us: But Lin Li reacted fast as well. He was ascending in the air at full speed, yet he was exceptionally calm. There wasn't any recitation of spell, only a peculiar hand gesture and the sound of a wind blade piercing the air was heard.

source: 林立只是看了这些苍蝇一眼，然后又耐着性子挤到索兰面前：“麻烦帮我把昨天邮寄的物品都取出来。”
en_us: Lin Li only glanced at these wasps, then once again calmly wedged his way through to reach Suo Lan. "Would you help me get the mail items posted yesterday?"

source: 林立可以容忍很多事，比如罗琳那自以为是的性格。
en_us: Lin Li could tolerate a lot of things, for example Rowling's self-righteous character.

source: 林立向来性格谨慎，开始冲击附魔专业的时候，也一直以使用永恒精金棒为目标，甚至为此提前准备了好几块永恒精金锭。
en_us: Lin Li had always been cautious. When he had begun to jolt his magical enchantment profession, the use of Eternal Adamantine had always been his aim. He had even prepared several pieces of Eternal Adamantine in advance for this purpose.

source: 林立听到这里就想笑，什么热心的魔法师先生，想泡你女儿才对吧，不然谁吃饱了撑的跑来落日山脉装热心……
en_us: Lin Li stifled a laugh at this. A warm-hearted mage? More like he's trying to court your daughter. Who else would be that idle coming to the Sunset Mountains being warm-hearted and all...

source: 林立听着那声响，只觉得一阵头皮发麻。
en_us: Lin Li's scalp tingled upon hearing the sound.

source: 林立咬了咬牙，从牙缝中吐出了三个字。
en_us: Lin Li clenched his teeth

source: 林立回头望去，正看见一头火红的长发。
en_us: Lin Li turned around and saw a head of long, fiery-red hair.

source: 林立在旁边一听，差点没笑出声来，怎么这年月胖子都喜欢当人叔叔？
en_us: Lin Li was listening at a side and he nearly burst out laughing. How come the fatties like to claim to be uncles nowadays?

source: 林立在柜台前看了一会，很快就有一名身穿制服的女店员过来招呼。
en_us: Lin Li was browsing before the counter for a while before a female attendant in uniform came to greet him.

source: 林立在炼金室里找了一圈，却始终找不到紫水晶容器，不由暗骂一声穷鬼魔法公会。
en_us: Lin Li looked around the alchemy lab but couldn't find the amethyst vessel. He couldn't resist cursing the poor, wretched Guild of Magic.

source: 林立在药剂室里忙碌，本该过来制止的老法师，却怔怔的望着门外发呆。
en_us: While Lin Li was busy in the pharmacy lab, the old mage would usually come in to check instead of staring distracted out at the window.

source: 林立在路上问了几个路人，很快就找到了翡翠之塔的方向。
en_us: Lin Li had asked several passers-by on the way and very soon found the direction to the Emerald Tower.

source: 林立在进行枯燥的练习，安度因却并没有象往常一样，吃完饭就一头扎进药剂室里忙碌，今天的老法师似乎有些反常，吃完饭后就一直留在房内，不声不响的看着林立练习，这种被人窥视的感觉让林立有些不太舒服，于是他不得不中断练习，抬起头来盯着老法师问道：“前几天教你的清晰药剂配方学会了？”
en_us: On other days, Andoine would keep himself busy in the pharmaceutical lab after breakfast. However, he stayed in his room that day and quietly watched Lin Li train. It made the latter uncomfortable to know that someone was watching him, so he stopped and looked at the old mage as he asked, “Have you learned the formula of the Clarity Potion I taught you a few days ago?”

source: 林立在迷宫中绕了很久，穿过了一条又一条的通道，才猛的觉得前方豁然开朗。
en_us: Lin Li circled the maze for a long time and went through one passage after another, when he suddenly saw light ahead.
